# SetTableData Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleTemplate..::..SetTableData Method
PanelScheduleTemplate Class See Also
---
Assigns table data to this template
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetTableData(
	PanelScheduleData Data
)
```

Visual Basic
---
```text
Public Sub SetTableData ( _
	Data As PanelScheduleData _
)
```

Visual C++
---
```text
public:
void SetTableData(
	PanelScheduleData^ Data
)
```

# ### Parameters
Data
    Type: Autodesk.Revit.DB.Electrical..::..PanelScheduleData The panel schedule data
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace